[Killed] BlockStatement
controllers/userController.ts:9:41
 
 
     // need to make new function to take in a req and parse the req
-    async handlePostRequest(user : User){
-        const userCookie = await UserModel.findOne({ cookieId: user["cookieId"] });
-        const userWallet = await UserModel.findOne({ walletId: user["walletId"] });
-
-        let userCookieExists = Boolean(userCookie)
-        let userWalletExists = Boolean(userWallet)
-        switch (true){
-            case (!userCookieExists && userWalletExists):
-                await this.updateUserCookies(user, userWallet)
-                return "reassigned user"
-            case (userCookieExists && !userWalletExists):
-                return "non existent wallet"
-            case (userCookieExists && userWalletExists):
-                //@ts-ignore
-                return this.handleKnownUser(userCookie.id, userWallet.id)
-            default:
-                return await this.addUserToDatabase(user)
-        }
-    }
+    async handlePostRequest(user : User){}
 
     /** Assumes that user does not exist in the database */
killedBy: Test handlePostRequest Should test Existent cookie, non identifiable wallet 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "non existent wallet"
Received: undefined

[Killed] StringLiteral
controllers/userController.ts:10:69
 
     // need to make new function to take in a req and parse the req
     async handlePostRequest(user : User){
-        const userCookie = await UserModel.findOne({ cookieId: user["cookieId"] });
+        const userCookie = await UserModel.findOne({ cookieId: user[""] });
         const userWallet = await UserModel.findOne({ walletId: user["walletId"] });
 
killedBy: Test handlePostRequest Should test Existent cookie, non identifiable wallet 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "non existent wallet"
Received: "added user to database"

[Killed] BlockStatement
controllers/userController.ts:70:82
      * @param userIdentity 
      * @param rating 
      */
-    async upsertRating(userIdentity : object, rating : Rating, protocol : string){
-        
-        const user = await UserModel.findOne({ 
-            cookieId: userIdentity["cookieId"], 
-            walletId: userIdentity["walletId"] 
-        });
-        if (!user) 
-            return 'user not found'
-        
-        const newRating = new RatingModel({rating})
-
-        let ratingExists = Boolean(user.protocolRatings.get(protocol))
-        if (ratingExists){
-            return "rating already submitted"
-        }
-        user.protocolRatings.set(protocol, newRating);
-        await user.save()
-        return "rating added"
-    }
+    async upsertRating(userIdentity : object, rating : Rating, protocol : string){}
 
     /**
killedBy: Test upsert rating Should return should return failure message for nonexistent user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user not found"
Received: undefined

[Killed] ObjectLiteral
controllers/userController.ts:72:46
      */
     async upsertRating(userIdentity : object, rating : Rating, protocol : string){
         
-        const user = await UserModel.findOne({ 
-            cookieId: userIdentity["cookieId"], 
-            walletId: userIdentity["walletId"] 
-        });
+        const user = await UserModel.findOne({});
         if (!user) 
             return 'user not found'
killedBy: Test upsert rating Should return should return failure message for nonexistent user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user not found"
Received: "rating added"

[Killed] StringLiteral
controllers/userController.ts:74:36
         
         const user = await UserModel.findOne({ 
             cookieId: userIdentity["cookieId"], 
-            walletId: userIdentity["walletId"] 
+            walletId: userIdentity[""] 
         });
         if (!user) 
killedBy: Test upsert rating should return rating added if user exists and new protocol is added
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rating added"
Received: "user not found"

[Killed] ConditionalExpression
controllers/userController.ts:76:13
             cookieId: userIdentity["cookieId"], 
             walletId: userIdentity["walletId"] 
         });
-        if (!user) 
+        if (false) 
             return 'user not found'
         
killedBy: Test upsert rating Should return should return failure message for nonexistent user
statusReason: TypeError: Cannot read properties of null (reading 'protocolRatings')

[Killed] BlockStatement
controllers/userController.ts:96:61
      * @param referee 
      * @param referrerCode 
      */
-    async addReferral(referee : User, referrerCode : string){
-        const referrer = await UserModel.findOne({
-            referralCode : referrerCode})
-
-        let status = this.checkReferralConditions(referee,
-                                         User.createUserFromDocument(referrer))
-        if (status != "valid" || referrer == null){
-            return status
-        }
-        referrer.referredUsers += 1
-        referrer.save()
-
-        return "successfully added/updated referral code"
-    }
+    async addReferral(referee : User, referrerCode : string){}
 
     private checkReferralConditions(user : User, referrer : User){
killedBy: Test add referral Should return an error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user not found"
Received: undefined

[Killed] EqualityOperator
controllers/userController.ts:102:13
 
         let status = this.checkReferralConditions(referee,
                                          User.createUserFromDocument(referrer))
-        if (status != "valid" || referrer == null){
+        if (status == "valid" || referrer == null){
             return status
         }
killedBy: Test add referral should return an error due to user adding themself
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user submitted own referral code"
Received: "successfully added/updated referral code"

[Killed] BlockStatement
controllers/userController.ts:111:66
         return "successfully added/updated referral code"
     }
 
-    private checkReferralConditions(user : User, referrer : User){
-        if (referrer.isNull()){
-            return "user not found"
-        }
-
-        if (referrer.walletId == user.walletId || 
-                referrer.cookieId == user.cookieId){
-            return "user submitted own referral code"
-        }
-
-        return "valid"
-    }
+    private checkReferralConditions(user : User, referrer : User){}
 
     /**
killedBy: Test add referral Should return an error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user not found"
Received: undefined

[Killed] ConditionalExpression
controllers/userController.ts:112:13
     }
 
     private checkReferralConditions(user : User, referrer : User){
-        if (referrer.isNull()){
+        if (false){
             return "user not found"
         }
killedBy: Test add referral Should return an error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user not found"
Received: "valid"

[Killed] ConditionalExpression
controllers/userController.ts:112:13
     }
 
     private checkReferralConditions(user : User, referrer : User){
-        if (referrer.isNull()){
+        if (true){
             return "user not found"
         }
killedBy: Test add referral should return an error due to user adding themself
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user submitted own referral code"
Received: "user not found"

[Killed] StringLiteral
controllers/userController.ts:113:20
 
     private checkReferralConditions(user : User, referrer : User){
         if (referrer.isNull()){
-            return "user not found"
+            return ""
         }
 
killedBy: Test add referral Should return an error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user not found"
Received: ""

[Killed] ConditionalExpression
controllers/userController.ts:116:13
             return "user not found"
         }
 
-        if (referrer.walletId == user.walletId || 
-                referrer.cookieId == user.cookieId){
+        if (false){
             return "user submitted own referral code"
         }
killedBy: Test add referral should return an error due to user adding themself
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user submitted own referral code"
Received: "successfully added/updated referral code"

[Killed] ConditionalExpression
controllers/userController.ts:116:13
             return "user not found"
         }
 
-        if (referrer.walletId == user.walletId || 
+        if (false || 
                 referrer.cookieId == user.cookieId){
             return "user submitted own referral code"
killedBy: Test add referral Should increase number of referred users 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] BlockStatement
controllers/userController.ts:117:52
         }
 
         if (referrer.walletId == user.walletId || 
-                referrer.cookieId == user.cookieId){
-            return "user submitted own referral code"
-        }
+                referrer.cookieId == user.cookieId){}
 
         return "valid"
killedBy: Test add referral should return an error due to user adding themself
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user submitted own referral code"
Received: "successfully added/updated referral code"

[Killed] ConditionalExpression
controllers/userController.ts:117:17
         }
 
         if (referrer.walletId == user.walletId || 
-                referrer.cookieId == user.cookieId){
+                false){
             return "user submitted own referral code"
         }
killedBy: Test add referral Should increase number of referred users 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] StringLiteral
controllers/userController.ts:121:16
             return "user submitted own referral code"
         }
 
-        return "valid"
+        return ""
     }
 
killedBy: Test add referral Should return success message when user adds message
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "successfully added/updated referral code"
Received: ""

[Killed] BlockStatement
controllers/userController.ts:129:58
      * if found and returns only message otherwise
      * @param cookieId 
      */
-    async getUserInfo(cookieId : string) : Promise<User> {
-        let user = await UserModel.findOne({ cookieId: cookieId})
-        if (!user){
-            return new NullUser()
-        }
-        let ret = User.createUserFromDocument(user)
-        return ret
-    }
+    async getUserInfo(cookieId : string) : Promise<User> {}
     
     /**
killedBy: Test get user info Should return an error message for unfound users
statusReason: TypeError: Cannot read properties of undefined (reading 'isNull')

[Killed] ObjectLiteral
controllers/userController.ts:130:44
      * @param cookieId 
      */
     async getUserInfo(cookieId : string) : Promise<User> {
-        let user = await UserModel.findOne({ cookieId: cookieId})
+        let user = await UserModel.findOne({})
         if (!user){
             return new NullUser()
killedBy: Test get user info Should return an error message for unfound users
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
controllers/userController.ts:131:13
      */
     async getUserInfo(cookieId : string) : Promise<User> {
         let user = await UserModel.findOne({ cookieId: cookieId})
-        if (!user){
+        if (true){
             return new NullUser()
         }
killedBy: Test get user info Should return a user for existing users
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
controllers/userController.ts:143:68
      * nullRating user or rating isn't found
      */
     async getUserRating(cookieId : string, 
-        walletId : string, protocolName : string) : Promise<Rating>{
-            const user = await UserModel.findOne(
-                { cookieId: cookieId, walletId: walletId });
-            if (!user){
-                return new NullRating()
-            }
-            const rating = user.protocolRatings.get(protocolName);
-            if (rating == null) return  new NullRating()
-
-            return Rating.fromIRating(rating)
-    }
+        walletId : string, protocolName : string) : Promise<Rating>{}
 
     
killedBy: Test getUserRating Should return a null rating
statusReason: TypeError: Cannot read properties of undefined (reading 'isNull')

[Killed] BooleanLiteral
controllers/userController.ts:146:17
         walletId : string, protocolName : string) : Promise<Rating>{
             const user = await UserModel.findOne(
                 { cookieId: cookieId, walletId: walletId });
-            if (!user){
+            if (user){
                 return new NullRating()
             }
killedBy: Test getUserRating Should return a null rating
statusReason: TypeError: Cannot read properties of null (reading 'protocolRatings')

[Killed] EqualityOperator
controllers/userController.ts:150:17
                 return new NullRating()
             }
             const rating = user.protocolRatings.get(protocolName);
-            if (rating == null) return  new NullRating()
+            if (rating != null) return  new NullRating()
 
             return Rating.fromIRating(rating)
killedBy: Test getUserRating Should return a rating
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bar"
Received: ""

[Killed] ConditionalExpression
controllers/userController.ts:150:17
                 return new NullRating()
             }
             const rating = user.protocolRatings.get(protocolName);
-            if (rating == null) return  new NullRating()
+            if (true) return  new NullRating()
 
             return Rating.fromIRating(rating)
killedBy: Test getUserRating Should return a rating
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bar"
Received: ""

[NoCoverage] BlockStatement
controllers/userController.ts:159:48
 }
 
 /** @returns a random alphanumeric code with length codeLength */
-function generateCode(codeLength = 8) : string {
-    const str = '0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz'
-    let code = ""
-    for (let i=0; i < codeLength; i++){
-        code += str.charAt(Math.floor(Math.random() * (str.length+1)));
-    }
-    return code
-}
+function generateCode(codeLength = 8) : string {}
 
 

[NoCoverage] EqualityOperator
controllers/userController.ts:162:19
 function generateCode(codeLength = 8) : string {
     const str = '0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz'
     let code = ""
-    for (let i=0; i < codeLength; i++){
+    for (let i=0; i >= codeLength; i++){
         code += str.charAt(Math.floor(Math.random() * (str.length+1)));
     }

[NoCoverage] BlockStatement
controllers/userController.ts:162:39
 function generateCode(codeLength = 8) : string {
     const str = '0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz'
     let code = ""
-    for (let i=0; i < codeLength; i++){
-        code += str.charAt(Math.floor(Math.random() * (str.length+1)));
-    }
+    for (let i=0; i < codeLength; i++){}
     return code
 }

[NoCoverage] AssignmentOperator
controllers/userController.ts:163:9
     const str = '0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz'
     let code = ""
     for (let i=0; i < codeLength; i++){
-        code += str.charAt(Math.floor(Math.random() * (str.length+1)));
+        code -= str.charAt(Math.floor(Math.random() * (str.length + 1)));
     }
     return code

[NoCoverage] MethodExpression
controllers/userController.ts:163:17
     const str = '0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz'
     let code = ""
     for (let i=0; i < codeLength; i++){
-        code += str.charAt(Math.floor(Math.random() * (str.length+1)));
+        code += str;
     }
     return code
