[Killed] BlockStatement
controllers/referralController.ts:6:57
 
 export default class ReferralController{
 
-    async checkReferralCodeExists(referralCode : string){
-        try{
-            const referralCodeExists = await UserModel.findOne({ 
-                referralCode: referralCode });
-            return Boolean(referralCodeExists)
-        }catch(err){
-            return false
-        }
-    }
+    async checkReferralCodeExists(referralCode : string){}
 
 
killedBy: Test get referral code Should return true for existent referral codes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
controllers/referralController.ts:7:12
 export default class ReferralController{
 
     async checkReferralCodeExists(referralCode : string){
-        try{
-            const referralCodeExists = await UserModel.findOne({ 
-                referralCode: referralCode });
-            return Boolean(referralCodeExists)
-        }catch(err){
+        try{}catch(err){
             return false
         }
killedBy: Test get referral code Should return true for existent referral codes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[NoCoverage] BlockStatement
controllers/referralController.ts:11:20
             const referralCodeExists = await UserModel.findOne({ 
                 referralCode: referralCode });
             return Boolean(referralCodeExists)
-        }catch(err){
-            return false
-        }
+        }catch(err){}
     }
 

[NoCoverage] BooleanLiteral
controllers/referralController.ts:12:20
                 referralCode: referralCode });
             return Boolean(referralCodeExists)
         }catch(err){
-            return false
+            return true
         }
     }

[Killed] BlockStatement
controllers/referralController.ts:17:77
     }
 
 
-    async handleAddReferral(referralCode : string, refereeWalletId : string){
-        const referee = await UserModel.findOne({walletId: refereeWalletId})
-
-        let response = await this.addReferral(
-                User.createUserFromDocument(referee), referralCode)
-        return response
-    }
+    async handleAddReferral(referralCode : string, refereeWalletId : string){}
 
     /**
killedBy: Test add referral code Should return unfound referee for no matching referee
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "referee not found"
Received: undefined

[Killed] BlockStatement
controllers/referralController.ts:31:61
      * @param referee 
      * @param referrerCode 
      */
-    async addReferral(referee : User, referrerCode : string){
-        const referrer = await UserModel.findOne({
-            referralCode : referrerCode})
-
-        let status = this.checkReferralConditions(referee,
-                                         User.createUserFromDocument(referrer))
-        if (status != "valid" || referrer == null){
-            return status
-        }
-        referrer.referredUsers += 1
-        await referrer.save()
-
-        return "successfully added/updated referral code"
-    }
+    async addReferral(referee : User, referrerCode : string){}
 
     private checkReferralConditions(referee : User, referrer : User){
killedBy: Test add referral Should return an error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "referrer not found"
Received: undefined

[Killed] ConditionalExpression
controllers/referralController.ts:37:13
 
         let status = this.checkReferralConditions(referee,
                                          User.createUserFromDocument(referrer))
-        if (status != "valid" || referrer == null){
+        if (true){
             return status
         }
killedBy: Test add referral code Should update referral code
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "successfully added/updated referral code"
Received: "valid"

[Killed] LogicalOperator
controllers/referralController.ts:37:13
 
         let status = this.checkReferralConditions(referee,
                                          User.createUserFromDocument(referrer))
-        if (status != "valid" || referrer == null){
+        if (status != "valid" && referrer == null){
             return status
         }
killedBy: Test add referral code Should catch case where user submits own referral code
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user submitted own referral code"
Received: "successfully added/updated referral code"

[Killed] AssignmentOperator
controllers/referralController.ts:40:9
         if (status != "valid" || referrer == null){
             return status
         }
-        referrer.referredUsers += 1
+        referrer.referredUsers -= 1
         await referrer.save()
 
killedBy: Test add referral Should increase number of referred users 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] BlockStatement
controllers/referralController.ts:46:69
         return "successfully added/updated referral code"
     }
 
-    private checkReferralConditions(referee : User, referrer : User){
-        
-        if (referee.isNull()) return "referee not found"
-        if (referrer.isNull()) return "referrer not found"
-        
-
-        if (referrer.walletId == referee.walletId || 
-                referrer.cookieId == referee.cookieId){
-            return "user submitted own referral code"
-        }
-
-        return "valid"
-    }
+    private checkReferralConditions(referee : User, referrer : User){}
 }
killedBy: Test add referral code Should return unfound referee for no matching referee
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "referee not found"
Received: undefined

[Killed] ConditionalExpression
controllers/referralController.ts:48:13
 
     private checkReferralConditions(referee : User, referrer : User){
         
-        if (referee.isNull()) return "referee not found"
+        if (true) return "referee not found"
         if (referrer.isNull()) return "referrer not found"
         
killedBy: Test add referral code Should return unfound referrer for no matching referral code
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "referrer not found"
Received: "referee not found"

[Killed] ConditionalExpression
controllers/referralController.ts:48:13
 
     private checkReferralConditions(referee : User, referrer : User){
         
-        if (referee.isNull()) return "referee not found"
+        if (false) return "referee not found"
         if (referrer.isNull()) return "referrer not found"
         
killedBy: Test add referral code Should return unfound referee for no matching referee
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "referee not found"
Received: "referrer not found"

[Killed] ConditionalExpression
controllers/referralController.ts:49:13
     private checkReferralConditions(referee : User, referrer : User){
         
         if (referee.isNull()) return "referee not found"
-        if (referrer.isNull()) return "referrer not found"
+        if (false) return "referrer not found"
         
 
killedBy: Test add referral code Should return unfound referrer for no matching referral code
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "referrer not found"
Received: "valid"

[Killed] ConditionalExpression
controllers/referralController.ts:49:13
     private checkReferralConditions(referee : User, referrer : User){
         
         if (referee.isNull()) return "referee not found"
-        if (referrer.isNull()) return "referrer not found"
+        if (true) return "referrer not found"
         
 
killedBy: Test add referral code Should catch case where user submits own referral code
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user submitted own referral code"
Received: "referrer not found"

[Killed] ConditionalExpression
controllers/referralController.ts:52:13
         if (referrer.isNull()) return "referrer not found"
         
 
-        if (referrer.walletId == referee.walletId || 
-                referrer.cookieId == referee.cookieId){
+        if (true){
             return "user submitted own referral code"
         }
killedBy: Test add referral code Should update referral code
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "successfully added/updated referral code"
Received: "user submitted own referral code"

[Killed] EqualityOperator
controllers/referralController.ts:52:13
         if (referrer.isNull()) return "referrer not found"
         
 
-        if (referrer.walletId == referee.walletId || 
+        if (referrer.walletId != referee.walletId || 
                 referrer.cookieId == referee.cookieId){
             return "user submitted own referral code"
killedBy: Test add referral Should return success message when user adds message
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "successfully added/updated referral code"
Received: "user submitted own referral code"

[Killed] BlockStatement
controllers/referralController.ts:53:55
         
 
         if (referrer.walletId == referee.walletId || 
-                referrer.cookieId == referee.cookieId){
-            return "user submitted own referral code"
-        }
+                referrer.cookieId == referee.cookieId){}
 
         return "valid"
killedBy: Test add referral should return an error due to user adding themself
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user submitted own referral code"
Received: "successfully added/updated referral code"

[Killed] EqualityOperator
controllers/referralController.ts:53:17
         
 
         if (referrer.walletId == referee.walletId || 
-                referrer.cookieId == referee.cookieId){
+                referrer.cookieId != referee.cookieId){
             return "user submitted own referral code"
         }
killedBy: Test add referral Should return success message when user adds message
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "successfully added/updated referral code"
Received: "user submitted own referral code"
