[Survived] BlockStatement
models/dbInterface/userDbInterface.ts:8:45
 export default class UserDbInterface{
 
     database : typeof UserModel;
-    constructor(database : typeof UserModel){
-        this.database = database
-    }
+    constructor(database : typeof UserModel){}
 
 

[Killed] BlockStatement
models/dbInterface/userDbInterface.ts:18:55
      * @returns A User object if the user is found. 
      * Otherwise returns an empty user
      */
-    async findUser(condition : object) : Promise<User>{
-        const user = await UserModel.findOne(condition)
-        if (user == null){
-            return new NullUser()
-        }
-        let ret = User.createUserFromDocument(user)
-        return ret
-    }
+    async findUser(condition : object) : Promise<User>{}
 
     /** 
killedBy: Test findUser Should return an empty user
statusReason: TypeError: Cannot read properties of undefined (reading 'isNull')

[Killed] EqualityOperator
models/dbInterface/userDbInterface.ts:20:13
      */
     async findUser(condition : object) : Promise<User>{
         const user = await UserModel.findOne(condition)
-        if (user == null){
+        if (user != null){
             return new NullUser()
         }
killedBy: Test findUser Should retrieve user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
models/dbInterface/userDbInterface.ts:20:13
      */
     async findUser(condition : object) : Promise<User>{
         const user = await UserModel.findOne(condition)
-        if (user == null){
+        if (true){
             return new NullUser()
         }
killedBy: Test findUser Should retrieve user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
models/dbInterface/userDbInterface.ts:31:41
      * Adds user to the database. Returns true if user has been added to
      * database. Returns false if user already exists in database or adding fails
      */
-    async addUserToDatabase(user : User){
-        let userModel;
-        let userExists = await UserModel.findOne({
-            cookieId: user.cookieId, walletId: user.walletId})
-        if (userExists){
-            return false
-        }
-        userModel = new UserModel(user.getUserObject())
-        await userModel.save()
-        return true
-    }
+    async addUserToDatabase(user : User){}
 
     async checkExists(user: User){
killedBy: Test addUserToDatabase Should return true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Survived] ObjectLiteral
models/dbInterface/userDbInterface.ts:33:50
      */
     async addUserToDatabase(user : User){
         let userModel;
-        let userExists = await UserModel.findOne({
-            cookieId: user.cookieId, walletId: user.walletId})
+        let userExists = await UserModel.findOne({})
         if (userExists){
             return false

[Killed] ConditionalExpression
models/dbInterface/userDbInterface.ts:35:13
         let userModel;
         let userExists = await UserModel.findOne({
             cookieId: user.cookieId, walletId: user.walletId})
-        if (userExists){
+        if (true){
             return false
         }
killedBy: Test addUserToDatabase Should return true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
models/dbInterface/userDbInterface.ts:35:13
         let userModel;
         let userExists = await UserModel.findOne({
             cookieId: user.cookieId, walletId: user.walletId})
-        if (userExists){
+        if (false){
             return false
         }
killedBy: Test addUserToDatabase Should return false when multiple users are added
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
models/dbInterface/userDbInterface.ts:36:20
         let userExists = await UserModel.findOne({
             cookieId: user.cookieId, walletId: user.walletId})
         if (userExists){
-            return false
+            return true
         }
         userModel = new UserModel(user.getUserObject())
killedBy: Test addUserToDatabase Should return false when multiple users are added
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
models/dbInterface/userDbInterface.ts:40:16
         }
         userModel = new UserModel(user.getUserObject())
         await userModel.save()
-        return true
+        return false
     }
 
killedBy: Test addUserToDatabase Should return true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[NoCoverage] BlockStatement
models/dbInterface/userDbInterface.ts:47:34
 
     }
 
-    async updateUser(user : User){
-
-        let foundUser = await UserModel.findOne({
-            cookieId: user.cookieId, walletId: user.walletId
-        })
-        if (!foundUser){
-            return false
-        }
-
-        
-        return true
-    }
+    async updateUser(user : User){}
 
     /** Adds user object to the database. Same as addUserToDatabase 

[NoCoverage] ConditionalExpression
models/dbInterface/userDbInterface.ts:52:13
         let foundUser = await UserModel.findOne({
             cookieId: user.cookieId, walletId: user.walletId
         })
-        if (!foundUser){
+        if (false){
             return false
         }

[NoCoverage] BlockStatement
models/dbInterface/userDbInterface.ts:52:24
         let foundUser = await UserModel.findOne({
             cookieId: user.cookieId, walletId: user.walletId
         })
-        if (!foundUser){
-            return false
-        }
+        if (!foundUser){}
 
         

[NoCoverage] BooleanLiteral
models/dbInterface/userDbInterface.ts:53:20
             cookieId: user.cookieId, walletId: user.walletId
         })
         if (!foundUser){
-            return false
+            return true
         }
 

[NoCoverage] BlockStatement
models/dbInterface/userDbInterface.ts:63:49
     /** Adds user object to the database. Same as addUserToDatabase 
      * Will throw error if user is an invalid object
     */
-    async addUserObjectToDatabase(user : object){
-        let userModel = new UserModel({
-            cookieId: user["cookieId"],
-            walletId: user["walletId"],
-            referralCode: user["referralCode"],
-            referredUsers: new Map(),
-            protocolRatings: new Map()
-        });
-        userModel.save()
-    }
+    async addUserObjectToDatabase(user : object){}
 
 }

[NoCoverage] StringLiteral
models/dbInterface/userDbInterface.ts:65:28
     */
     async addUserObjectToDatabase(user : object){
         let userModel = new UserModel({
-            cookieId: user["cookieId"],
+            cookieId: user[""],
             walletId: user["walletId"],
             referralCode: user["referralCode"],
