[Timeout] BlockStatement
models/user/User.ts:10:50
     scores : number[];
     code : string
     
-    constructor(scores : number[], code?: string){
-        this.scores = scores
-        if (code == null){
-            this.code = ""
-        }else{
-            this.code = code
-        }
-    }
+    constructor(scores : number[], code?: string){}
 
     static fromObject(rating : object){

[NoCoverage] BlockStatement
models/user/User.ts:12:26
     
     constructor(scores : number[], code?: string){
         this.scores = scores
-        if (code == null){
-            this.code = ""
-        }else{
+        if (code == null){}else{
             this.code = code
         }

[Timeout] ConditionalExpression
models/user/User.ts:12:13
     
     constructor(scores : number[], code?: string){
         this.scores = scores
-        if (code == null){
+        if (true){
             this.code = ""
         }else{

[Timeout] BlockStatement
models/user/User.ts:14:14
         this.scores = scores
         if (code == null){
             this.code = ""
-        }else{
-            this.code = code
-        }
+        }else{}
     }
 

[Timeout] BlockStatement
models/user/User.ts:19:39
         }
     }
 
-    static fromObject(rating : object){
-        let code : string = rating["code"] || ""
-        let scores = rating["scores"]
-        return new Rating(scores, code)
-    }
+    static fromObject(rating : object){}
 
     static fromIRating(rating : IRating){

[Survived] ConditionalExpression
models/user/User.ts:20:29
     }
 
     static fromObject(rating : object){
-        let code : string = rating["code"] || ""
+        let code : string = false
         let scores = rating["scores"]
         return new Rating(scores, code)

[Survived] ConditionalExpression
models/user/User.ts:20:29
     }
 
     static fromObject(rating : object){
-        let code : string = rating["code"] || ""
+        let code : string = true
         let scores = rating["scores"]
         return new Rating(scores, code)

[Survived] StringLiteral
models/user/User.ts:21:29
 
     static fromObject(rating : object){
         let code : string = rating["code"] || ""
-        let scores = rating["scores"]
+        let scores = rating[""]
         return new Rating(scores, code)
     }

[Timeout] BlockStatement
models/user/User.ts:25:41
         return new Rating(scores, code)
     }
 
-    static fromIRating(rating : IRating){
-        return new this(rating.scores, rating.code)
-    }
+    static fromIRating(rating : IRating){}
 
     getRatingObject(){

[Killed] BlockStatement
models/user/User.ts:29:22
         return new this(rating.scores, rating.code)
     }
 
-    getRatingObject(){
-        return {scores: this.scores, code: this.code}
-    }
+    getRatingObject(){}
     isNull(): boolean {return false}
 
killedBy: Test get rating Should return rating if it exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "World"
Received: undefined

[Killed] ObjectLiteral
models/user/User.ts:30:16
     }
 
     getRatingObject(){
-        return {scores: this.scores, code: this.code}
+        return {}
     }
     isNull(): boolean {return false}
killedBy: Test get rating Should return rating if it exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "World"
Received: ""

[Killed] BooleanLiteral
models/user/User.ts:32:31
     getRatingObject(){
         return {scores: this.scores, code: this.code}
     }
-    isNull(): boolean {return false}
+    isNull(): boolean {return true}
 
     getErrorMessage() {return "Rating object has no error message"}
killedBy: Test get rating Should return rating if it exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "World"
Received: undefined

[Survived] BlockStatement
models/user/User.ts:32:23
     getRatingObject(){
         return {scores: this.scores, code: this.code}
     }
-    isNull(): boolean {return false}
+    isNull(): boolean {}
 
     getErrorMessage() {return "Rating object has no error message"}

[NoCoverage] BlockStatement
models/user/User.ts:34:23
     }
     isNull(): boolean {return false}
 
-    getErrorMessage() {return "Rating object has no error message"}
+    getErrorMessage() {}
 }
 

[Timeout] BlockStatement
models/user/User.ts:39:40
 
 class NullRating extends Rating{
     errorMessage : string;
-    constructor(errorMessage ?: string){
-        super([0,0,0,0,0], "")
-        if (errorMessage == null) {this.errorMessage = ""}
-        else{ this.errorMessage = errorMessage}
-    }
+    constructor(errorMessage ?: string){}
     isNull(): boolean {return true}
     getErrorMessage() {return this.errorMessage}

[Survived] ArrayDeclaration
models/user/User.ts:40:15
 class NullRating extends Rating{
     errorMessage : string;
     constructor(errorMessage ?: string){
-        super([0,0,0,0,0], "")
+        super([], "")
         if (errorMessage == null) {this.errorMessage = ""}
         else{ this.errorMessage = errorMessage}

[Survived] StringLiteral
models/user/User.ts:40:28
 class NullRating extends Rating{
     errorMessage : string;
     constructor(errorMessage ?: string){
-        super([0,0,0,0,0], "")
+        super([0,0,0,0,0], "Stryker was here!")
         if (errorMessage == null) {this.errorMessage = ""}
         else{ this.errorMessage = errorMessage}

[Killed] ConditionalExpression
models/user/User.ts:41:13
     errorMessage : string;
     constructor(errorMessage ?: string){
         super([0,0,0,0,0], "")
-        if (errorMessage == null) {this.errorMessage = ""}
+        if (true) {this.errorMessage = ""}
         else{ this.errorMessage = errorMessage}
     }
killedBy: Test get rating Should return User not found if user cannot be found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User not found"
Received: ""

[Killed] EqualityOperator
models/user/User.ts:41:13
     errorMessage : string;
     constructor(errorMessage ?: string){
         super([0,0,0,0,0], "")
-        if (errorMessage == null) {this.errorMessage = ""}
+        if (errorMessage != null) {this.errorMessage = ""}
         else{ this.errorMessage = errorMessage}
     }
killedBy: Test get rating Should return User not found if user cannot be found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User not found"
Received: ""

[Killed] BlockStatement
models/user/User.ts:42:13
     constructor(errorMessage ?: string){
         super([0,0,0,0,0], "")
         if (errorMessage == null) {this.errorMessage = ""}
-        else{ this.errorMessage = errorMessage}
+        else{}
     }
     isNull(): boolean {return true}
killedBy: Test get rating Should return User not found if user cannot be found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User not found"
Received: undefined

[Killed] BooleanLiteral
models/user/User.ts:44:31
         if (errorMessage == null) {this.errorMessage = ""}
         else{ this.errorMessage = errorMessage}
     }
-    isNull(): boolean {return true}
+    isNull(): boolean {return false}
     getErrorMessage() {return this.errorMessage}
 }
killedBy: Test get rating Should return User not found if user cannot be found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User not found"
Received: undefined

[Killed] BlockStatement
models/user/User.ts:44:23
         if (errorMessage == null) {this.errorMessage = ""}
         else{ this.errorMessage = errorMessage}
     }
-    isNull(): boolean {return true}
+    isNull(): boolean {}
     getErrorMessage() {return this.errorMessage}
 }
killedBy: Test get rating Should return User not found if user cannot be found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User not found"
Received: undefined

[Killed] BlockStatement
models/user/User.ts:45:23
         else{ this.errorMessage = errorMessage}
     }
     isNull(): boolean {return true}
-    getErrorMessage() {return this.errorMessage}
+    getErrorMessage() {}
 }
 
killedBy: Test get rating Should return User not found if user cannot be found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User not found"
Received: undefined

[Timeout] BlockStatement
models/user/User.ts:65:48
         walletId: string,
         referralCode ?: string,
         referredUsers ?: number,
-        protocolRatings ?: Map<string, Rating>){
-            this.cookieId = cookieId
-            this.walletId = walletId
-
-            if (referralCode == null){
-                this.referralCode = ""
-            }else{
-                this.referralCode = referralCode
-            }
-           
-            if (!referredUsers){
-                this.numReferredUsers = 0
-            }else{
-                this.numReferredUsers = referredUsers
-            }
-            
-            if (!protocolRatings){
-                this.protocolRatings = new Map()
-            }else{
-                this.protocolRatings = protocolRatings
-            }
-
-    }
+        protocolRatings ?: Map<string, Rating>){}
 
     isNull() : boolean{ return false }

[Killed] EqualityOperator
models/user/User.ts:69:17
             this.cookieId = cookieId
             this.walletId = walletId
 
-            if (referralCode == null){
+            if (referralCode != null){
                 this.referralCode = ""
             }else{
killedBy: Test add referral code Should catch case where user submits own referral code
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user submitted own referral code"
Received: "referrer not found"

[Killed] ConditionalExpression
models/user/User.ts:69:17
             this.cookieId = cookieId
             this.walletId = walletId
 
-            if (referralCode == null){
+            if (true){
                 this.referralCode = ""
             }else{
killedBy: Test add referral code Should catch case where user submits own referral code
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user submitted own referral code"
Received: "referrer not found"

[Killed] StringLiteral
models/user/User.ts:70:37
             this.walletId = walletId
 
             if (referralCode == null){
-                this.referralCode = ""
+                this.referralCode = "Stryker was here!"
             }else{
                 this.referralCode = referralCode
killedBy: Test constructor Should create user without referral and returns empty string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"

[Killed] BlockStatement
models/user/User.ts:71:18
 
             if (referralCode == null){
                 this.referralCode = ""
-            }else{
-                this.referralCode = referralCode
-            }
+            }else{}
            
             if (!referredUsers){
killedBy: Test creating object from json Should create a basic object
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "cookieId": "uwu",
    "protocolRatings": Object {},

[Killed] ConditionalExpression
models/user/User.ts:75:17
                 this.referralCode = referralCode
             }
            
-            if (!referredUsers){
+            if (true){
                 this.numReferredUsers = 0
             }else{
killedBy: Test constructor Should create users with referredUsers and the referredUsers should exist 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
models/user/User.ts:75:32
                 this.referralCode = referralCode
             }
            
-            if (!referredUsers){
-                this.numReferredUsers = 0
-            }else{
+            if (!referredUsers){}else{
                 this.numReferredUsers = referredUsers
             }
killedBy: Test add referral code Should return unfound referee for no matching referee
statusReason: ValidationError: user validation failed: referredUsers: Path `referredUsers` is required.

[Killed] BlockStatement
models/user/User.ts:77:18
            
             if (!referredUsers){
                 this.numReferredUsers = 0
-            }else{
-                this.numReferredUsers = referredUsers
-            }
+            }else{}
             
             if (!protocolRatings){
killedBy: Test constructor Should create users with referredUsers and the referredUsers should exist 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ConditionalExpression
models/user/User.ts:81:17
                 this.numReferredUsers = referredUsers
             }
             
-            if (!protocolRatings){
+            if (true){
                 this.protocolRatings = new Map()
             }else{
killedBy: Test get rating Should return rating if it exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "World"
Received: undefined

[Killed] BlockStatement
models/user/User.ts:81:34
                 this.numReferredUsers = referredUsers
             }
             
-            if (!protocolRatings){
-                this.protocolRatings = new Map()
-            }else{
+            if (!protocolRatings){}else{
                 this.protocolRatings = protocolRatings
             }
killedBy: Test constructor Should create user without protocolRatings and returns empty map
statusReason: TypeError: Cannot read properties of undefined (reading 'size')

[Timeout] BlockStatement
models/user/User.ts:83:18
             
             if (!protocolRatings){
                 this.protocolRatings = new Map()
-            }else{
-                this.protocolRatings = protocolRatings
-            }
+            }else{}
 
     }

[Killed] BlockStatement
models/user/User.ts:89:23
 
     }
 
-    isNull() : boolean{ return false }
+    isNull() : boolean{}
     getErrorMessage() {return "User object has no error message"}
 
killedBy: Test isNull Should return isNull for objects
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BooleanLiteral
models/user/User.ts:89:32
 
     }
 
-    isNull() : boolean{ return false }
+    isNull() : boolean{ return true }
     getErrorMessage() {return "User object has no error message"}
 
killedBy: Test get user info Should return an existing user if the user exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "owo"
Received: undefined

[NoCoverage] BlockStatement
models/user/User.ts:90:23
     }
 
     isNull() : boolean{ return false }
-    getErrorMessage() {return "User object has no error message"}
+    getErrorMessage() {}
 
     /**

[Timeout] BlockStatement
models/user/User.ts:95:54
     /**
      * Instantiates user from object. Assumes that object is properly formatted
      */
-    static createUserFromObject(obj : object) : User {
-        let protocolRatings = _.keyBy(obj["protocolRatings"])
-
-        let user = new User(
-            obj["cookieId"], obj["walletId"], obj["referralCode"],
-            obj["numReferredUsers"], protocolRatings)
-        
-        return user
-    }
+    static createUserFromObject(obj : object) : User {}
 
     /** Creates user object based on MongoDB object */

[Timeout] BlockStatement
models/user/User.ts:106:66
     }
 
     /** Creates user object based on MongoDB object */
-    static createUserFromDocument(document : UserDocument | null){
-        if (document == null){
-            return new NullUser()
-        }
-
-        let protocolRatings = new Map(Array.from(
-            document.protocolRatings,
-             ([k, v] : [string, IRating]) => [k, Rating.fromIRating(v)]
-        ))
-        return new this(
-            document.cookieId, document.walletId, document.referralCode, 
-            document.referredUsers, protocolRatings)
-    }
+    static createUserFromDocument(document : UserDocument | null){}
 
     addReferredUser(){

[Killed] ConditionalExpression
models/user/User.ts:107:13
 
     /** Creates user object based on MongoDB object */
     static createUserFromDocument(document : UserDocument | null){
-        if (document == null){
+        if (true){
             return new NullUser()
         }
killedBy: Test get user info Should return an existing user if the user exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "owo"
Received: undefined

[Timeout] ConditionalExpression
models/user/User.ts:107:13
 
     /** Creates user object based on MongoDB object */
     static createUserFromDocument(document : UserDocument | null){
-        if (document == null){
+        if (false){
             return new NullUser()
         }

[Survived] ArrowFunction
models/user/User.ts:113:14
 
         let protocolRatings = new Map(Array.from(
             document.protocolRatings,
-             ([k, v] : [string, IRating]) => [k, Rating.fromIRating(v)]
+             () => undefined
         ))
         return new this(

[Killed] BlockStatement
models/user/User.ts:120:22
             document.referredUsers, protocolRatings)
     }
 
-    addReferredUser(){
-        this.numReferredUsers += 1
-    }
+    addReferredUser(){}
     
     getNumReferrredUsers(){
killedBy: Test constructor Should add 1 more user
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] AssignmentOperator
models/user/User.ts:121:9
     }
 
     addReferredUser(){
-        this.numReferredUsers += 1
+        this.numReferredUsers -= 1
     }
     
killedBy: Test constructor Should add 1 more user
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: -1

[Killed] BlockStatement
models/user/User.ts:124:27
         this.numReferredUsers += 1
     }
     
-    getNumReferrredUsers(){
-        return this.numReferredUsers
-    }
+    getNumReferrredUsers(){}
 
     setProtocolRating(protocol : string, rating : Rating){
killedBy: Test constructor Should create user without referredUsers and returns empty map
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
models/user/User.ts:128:58
         return this.numReferredUsers
     }
 
-    setProtocolRating(protocol : string, rating : Rating){
-        if (this.protocolRatings.get(protocol)){
-            return false
-        }
-        this.protocolRatings.set(protocol, rating)
-        return true
-    }
+    setProtocolRating(protocol : string, rating : Rating){}
 
     setProtocolRatingString(protocol : string, score : number[], referral?: string){
killedBy: Test getUserRating Should return a rating
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bar"
Received: ""

[Killed] ConditionalExpression
models/user/User.ts:129:13
     }
 
     setProtocolRating(protocol : string, rating : Rating){
-        if (this.protocolRatings.get(protocol)){
+        if (true){
             return false
         }
killedBy: Test getUserRating Should return a rating
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bar"
Received: ""

[Survived] ConditionalExpression
models/user/User.ts:129:13
     }
 
     setProtocolRating(protocol : string, rating : Rating){
-        if (this.protocolRatings.get(protocol)){
+        if (false){
             return false
         }

[NoCoverage] BooleanLiteral
models/user/User.ts:130:20
 
     setProtocolRating(protocol : string, rating : Rating){
         if (this.protocolRatings.get(protocol)){
-            return false
+            return true
         }
         this.protocolRatings.set(protocol, rating)

[Survived] BooleanLiteral
models/user/User.ts:133:16
             return false
         }
         this.protocolRatings.set(protocol, rating)
-        return true
+        return false
     }
 

[Killed] BlockStatement
models/user/User.ts:136:84
         return true
     }
 
-    setProtocolRatingString(protocol : string, score : number[], referral?: string){
-        this.setProtocolRating(protocol, new Rating(score, referral))
-    }
+    setProtocolRatingString(protocol : string, score : number[], referral?: string){}
 
     /** returns a deep copy of protocol ratings */
killedBy: Test user get methods Should correctly get protocol ratings
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 22
+ Received  +  1

- Object {
-   "Your dad": Object {
-     "code": "",

[Killed] BlockStatement
models/user/User.ts:141:24
     }
 
     /** returns a deep copy of protocol ratings */
-    getProtocolRating(){
-        return structuredClone(this.protocolRatings)
-    }
+    getProtocolRating(){}
 
     protocolExistsInRating(protocol : string){
killedBy: Test constructor Should create user without protocolRatings and returns empty map
statusReason: TypeError: Cannot read properties of undefined (reading 'size')

[Killed] BlockStatement
models/user/User.ts:145:46
         return structuredClone(this.protocolRatings)
     }
 
-    protocolExistsInRating(protocol : string){
-        return Boolean(this.protocolRatings.get(protocol))
-    }
+    protocolExistsInRating(protocol : string){}
 
     getProtocolRatingObject(){
killedBy: Test user existence methods should correctly check a protocol exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Timeout] BlockStatement
models/user/User.ts:149:30
         return Boolean(this.protocolRatings.get(protocol))
     }
 
-    getProtocolRatingObject(){
-        let protocolRatingObject = 
-        Array.from(this.protocolRatings).reduce((obj : any, 
-                                        [key, value] : [string, Rating])=>{
-            {
-                obj[key] = value.getRatingObject()
-                return obj
-            }
-        }, {})
-        return protocolRatingObject
-    }
+    getProtocolRatingObject(){}
 
     static convertIRatingToRating(iRatings : Map<string, IRating>){

[Timeout] BlockStatement
models/user/User.ts:152:75
     getProtocolRatingObject(){
         let protocolRatingObject = 
         Array.from(this.protocolRatings).reduce((obj : any, 
-                                        [key, value] : [string, Rating])=>{
-            {
-                obj[key] = value.getRatingObject()
-                return obj
-            }
-        }, {})
+                                        [key, value] : [string, Rating])=>{}, {})
         return protocolRatingObject
     }

[Timeout] BlockStatement
models/user/User.ts:153:13
         let protocolRatingObject = 
         Array.from(this.protocolRatings).reduce((obj : any, 
                                         [key, value] : [string, Rating])=>{
-            {
-                obj[key] = value.getRatingObject()
-                return obj
-            }
+            {}
         }, {})
         return protocolRatingObject

[NoCoverage] BlockStatement
models/user/User.ts:161:67
         return protocolRatingObject
     }
 
-    static convertIRatingToRating(iRatings : Map<string, IRating>){
-        let referredUsersObject  = new Map<string, Rating>()
-        Array.from(iRatings).reduce((obj : any, [key, value] : [string, any])=>{
-            {
-                referredUsersObject.set(key, Rating.fromIRating(value))
-            }
-        }, {})
-        return referredUsersObject
-    }
+    static convertIRatingToRating(iRatings : Map<string, IRating>){}
 
     getUserObject() : object{

[NoCoverage] BlockStatement
models/user/User.ts:163:80
 
     static convertIRatingToRating(iRatings : Map<string, IRating>){
         let referredUsersObject  = new Map<string, Rating>()
-        Array.from(iRatings).reduce((obj : any, [key, value] : [string, any])=>{
-            {
-                referredUsersObject.set(key, Rating.fromIRating(value))
-            }
-        }, {})
+        Array.from(iRatings).reduce((obj : any, [key, value] : [string, any])=>{}, {})
         return referredUsersObject
     }

[NoCoverage] BlockStatement
models/user/User.ts:164:13
     static convertIRatingToRating(iRatings : Map<string, IRating>){
         let referredUsersObject  = new Map<string, Rating>()
         Array.from(iRatings).reduce((obj : any, [key, value] : [string, any])=>{
-            {
-                referredUsersObject.set(key, Rating.fromIRating(value))
-            }
+            {}
         }, {})
         return referredUsersObject

[Killed] BlockStatement
models/user/User.ts:171:29
         return referredUsersObject
     }
 
-    getUserObject() : object{
-        let getProtocolRatingObject = this.getProtocolRatingObject()
-        let userObject = {
-            "cookieId": this.cookieId, "walletId": this.walletId, 
-            "referralCode": this.referralCode, 
-            "referredUsers": this.numReferredUsers,
-            "protocolRatings": getProtocolRatingObject
-        }
-        return userObject
-    }
+    getUserObject() : object{}
 
 }
killedBy: Add rating tests Should say user not found
statusReason: ValidationError: user validation failed: referredUsers: Path `referredUsers` is required., walletId: Path `walletId` is required., cookieId: Path `cookieId` is required.

[Timeout] BlockStatement
models/user/User.ts:188:40
     
     errorMessage : string
 
-    constructor(errorMessage ?: string){
-        super("", "")
-        this.errorMessage = errorMessage || ""
-    }
+    constructor(errorMessage ?: string){}
 
     isNull() : boolean {return true}

[Survived] StringLiteral
models/user/User.ts:189:15
     errorMessage : string
 
     constructor(errorMessage ?: string){
-        super("", "")
+        super("Stryker was here!", "")
         this.errorMessage = errorMessage || ""
     }

[Killed] ConditionalExpression
models/user/User.ts:190:29
 
     constructor(errorMessage ?: string){
         super("", "")
-        this.errorMessage = errorMessage || ""
+        this.errorMessage = false
     }
 
killedBy: Test get user info Should return null user if user does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User not found"
Received: false

[Killed] LogicalOperator
models/user/User.ts:190:29
 
     constructor(errorMessage ?: string){
         super("", "")
-        this.errorMessage = errorMessage || ""
+        this.errorMessage = errorMessage && ""
     }
 
killedBy: Test get user info Should return null user if user does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User not found"
Received: ""

[Killed] BooleanLiteral
models/user/User.ts:193:32
         this.errorMessage = errorMessage || ""
     }
 
-    isNull() : boolean {return true}
+    isNull() : boolean {return false}
     getErrorMessage(): string {return this.errorMessage}
 }
killedBy: Test get user info Should return null user if user does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User not found"
Received: undefined

[Killed] BlockStatement
models/user/User.ts:193:24
         this.errorMessage = errorMessage || ""
     }
 
-    isNull() : boolean {return true}
+    isNull() : boolean {}
     getErrorMessage(): string {return this.errorMessage}
 }
killedBy: Test get user info Should return null user if user does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User not found"
Received: undefined

[Killed] BlockStatement
models/user/User.ts:194:31
     }
 
     isNull() : boolean {return true}
-    getErrorMessage(): string {return this.errorMessage}
+    getErrorMessage(): string {}
 }
 
killedBy: Test get user info Should return null user if user does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User not found"
Received: undefined
