[Timeout] BlockStatement
routes/defiData.ts:11:56
  * Returns defi data
  * TODO Improve efficiency
  */
-router.get("/", async (req: Request, res: Response) => {
-    try{
-        const defiData = await DefiDataModel.find({})
-        res.json(defiData)
-    }catch (err){
-        res.json(err)
-    }
-    
-});
+router.get("/", async (req: Request, res: Response) => {});
 
 

[Timeout] BlockStatement
routes/defiData.ts:12:8
  * TODO Improve efficiency
  */
 router.get("/", async (req: Request, res: Response) => {
-    try{
-        const defiData = await DefiDataModel.find({})
-        res.json(defiData)
-    }catch (err){
+    try{}catch (err){
         res.json(err)
     }

[NoCoverage] BlockStatement
routes/defiData.ts:15:17
     try{
         const defiData = await DefiDataModel.find({})
         res.json(defiData)
-    }catch (err){
-        res.json(err)
-    }
+    }catch (err){}
     
 });
