[Timeout] BlockStatement
routes/protocols.ts:14:56
  * in descending otherwise
  * If db is empty then return an empty list
  */
-router.get("/", async (req: Request, res: Response) => {
-    let protocolController = new ProtocolController(ProtocolModel)
-    try{
-        let jsonResponse = await protocolController.getProtocolJson(req)
-        res.status(200).json(jsonResponse)
-    }catch(error){
-        res.status(400).json(error) 
-    }
-});
+router.get("/", async (req: Request, res: Response) => {});
 
 /**

[Timeout] BlockStatement
routes/protocols.ts:16:8
  */
 router.get("/", async (req: Request, res: Response) => {
     let protocolController = new ProtocolController(ProtocolModel)
-    try{
-        let jsonResponse = await protocolController.getProtocolJson(req)
-        res.status(200).json(jsonResponse)
-    }catch(error){
+    try{}catch(error){
         res.status(400).json(error) 
     }

[NoCoverage] BlockStatement
routes/protocols.ts:19:18
     try{
         let jsonResponse = await protocolController.getProtocolJson(req)
         res.status(200).json(jsonResponse)
-    }catch(error){
-        res.status(400).json(error) 
-    }
+    }catch(error){}
 });
 

[Timeout] BlockStatement
routes/protocols.ts:31:57
  * @Returns 500 status if request is null
  * @Returns an error if the request is null
  */
-router.post("/", async (req: Request, res: Response) => {
-    let protocolController = new ProtocolController(ProtocolModel)
-    try {
-        let successStatus = await protocolController.addProtocolJson(req.body)
-        res.status(201).json(successStatus);
-    } catch (error) {
-        res.status(500).json({ message: error });
-    }
-});
+router.post("/", async (req: Request, res: Response) => {});
 
 module.exports.router = router

[Survived] StringLiteral
routes/protocols.ts:31:13
  * @Returns 500 status if request is null
  * @Returns an error if the request is null
  */
-router.post("/", async (req: Request, res: Response) => {
+router.post("", async (req: Request, res: Response) => {
     let protocolController = new ProtocolController(ProtocolModel)
     try {

[Timeout] BlockStatement
routes/protocols.ts:33:9
  */
 router.post("/", async (req: Request, res: Response) => {
     let protocolController = new ProtocolController(ProtocolModel)
-    try {
-        let successStatus = await protocolController.addProtocolJson(req.body)
-        res.status(201).json(successStatus);
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).json({ message: error });
     }

[Timeout] BlockStatement
routes/protocols.ts:36:21
     try {
         let successStatus = await protocolController.addProtocolJson(req.body)
         res.status(201).json(successStatus);
-    } catch (error) {
-        res.status(500).json({ message: error });
-    }
+    } catch (error) {}
 });
 
