[Killed] BlockStatement
routes/user.ts:13:55
 /**
  * Get a list of users
  */
-router.get("/", async(req: Request, res: Response) => {
-    try{
-        const users = await UserModel.find({})
-        res.json(users)
-    }catch(err){
-        res.json(err);
-    }
-});
+router.get("/", async(req: Request, res: Response) => {});
 
 
killedBy: Get user tests Should get all users
statusReason: Error: thrown: "Exceeded timeout of 10000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
routes/user.ts:14:8
  * Get a list of users
  */
 router.get("/", async(req: Request, res: Response) => {
-    try{
-        const users = await UserModel.find({})
-        res.json(users)
-    }catch(err){
+    try{}catch(err){
         res.json(err);
     }
killedBy: Get user tests Should get all users
statusReason: Error: thrown: "Exceeded timeout of 10000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[NoCoverage] BlockStatement
routes/user.ts:17:16
     try{
         const users = await UserModel.find({})
         res.json(users)
-    }catch(err){
-        res.json(err);
-    }
+    }catch(err){}
 });
 

[Killed] BlockStatement
routes/user.ts:28:57
  * Client-side interface: cookieId, walletId, 
  * randomly-generated referralCode (run get request below first)
  */
-router.post("/", async (req: Request, res: Response) => {
-    const user = req.body;
-    let message = await userController.handlePostRequest(User.createUserFromObject(user))
-    res.json({message : message})
-});
+router.post("/", async (req: Request, res: Response) => {});
 
 
killedBy: Add user tests Should add user to database
statusReason: Error: thrown: "Exceeded timeout of 10000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ObjectLiteral
routes/user.ts:31:14
 router.post("/", async (req: Request, res: Response) => {
     const user = req.body;
     let message = await userController.handlePostRequest(User.createUserFromObject(user))
-    res.json({message : message})
+    res.json({})
 });
 
killedBy: Add user tests Should add user to database
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "added user to database"
Received: undefined

[Timeout] BlockStatement
routes/user.ts:35:77
 });
 
 
-router.get("/getUserInfo/:cookieId", async (req: Request, res: Response) => {
-    const { cookieId } = req.params;
-    let response = await userController.handleGetUserInfo(cookieId)
-    res.status(response.status).json(response.message)
-});
+router.get("/getUserInfo/:cookieId", async (req: Request, res: Response) => {});
 
 

[Timeout] BlockStatement
routes/user.ts:46:52
  * GET request to check if a user with a specific cookieId exists
  * @returns false if user does not exist and true otherwise
  */
-router.get("/check/:cookieId", async (req, res) => {
-    const { cookieId } = req.params;
-    let response = await userController.handleCheckUserExists(cookieId)
-    res.json(response)
-  });
+router.get("/check/:cookieId", async (req, res) => {});
 
 

[Timeout] StringLiteral
routes/user.ts:46:12
  * GET request to check if a user with a specific cookieId exists
  * @returns false if user does not exist and true otherwise
  */
-router.get("/check/:cookieId", async (req, res) => {
+router.get("", async (req, res) => {
     const { cookieId } = req.params;
     let response = await userController.handleCheckUserExists(cookieId)
