[Killed] BlockStatement
controllers/protocolController.ts:13:49
 export default class ProtocolController{
     database: any;
 
-    constructor(database : mongoose.Model<any>) {
-        this.database = database
-    }
+    constructor(database : mongoose.Model<any>) {}
 
     async getProtocolsFromDatabase(order : number) {
killedBy: addRating tests should output in correct status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BlockStatement
controllers/protocolController.ts:17:52
         this.database = database
     }
 
-    async getProtocolsFromDatabase(order : number) {
-        let test = await this.database.find({}).sort({averageScore : order})
-        return test
-    }
+    async getProtocolsFromDatabase(order : number) {}
 
     /** Retrieves protocol data and returns it as a list of 
killedBy: addRating tests should output in correct status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] MethodExpression
controllers/protocolController.ts:18:26
     }
 
     async getProtocolsFromDatabase(order : number) {
-        let test = await this.database.find({}).sort({averageScore : order})
+        let test = await this.database.find({})
         return test
     }
killedBy: Single MongoMemoryServer Should give json data in ascending
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a"
Received: "b"

[Killed] BlockStatement
controllers/protocolController.ts:24:37
 
     /** Retrieves protocol data and returns it as a list of 
      * json in the form protocolName, disputeCount, averageScore*/
-    async getProtocolJson(req : any){
-        let order = this.getOrder(req.query)
-        let databaseProtocols = await this.getProtocolsFromDatabase(order)
-        let databaseProtocolsJson = this.formatProtocolData(databaseProtocols)
-        return databaseProtocolsJson
-    }
+    async getProtocolJson(req : any){}
 
     private formatProtocolData(data : any){
killedBy: addRating tests should output with correct data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"averageScore": 85, "disputeCount": 10, "protocolName": "Protocol1"}, {"averageScore": 95, "disputeCount": 5, "protocolName": "Protocol2"}]
Received: ""

[Killed] BlockStatement
controllers/protocolController.ts:31:43
         return databaseProtocolsJson
     }
 
-    private formatProtocolData(data : any){
-        let value = data.map((result : any) => ({
-            protocolName: result["protocolName"],
-            disputeCount: result["disputeCount"],
-            averageScore: result["averageScore"]
-        }))
-        return value
-    }
+    private formatProtocolData(data : any){}
 
     private getOrder(query : any){
killedBy: addRating tests should output with correct data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"averageScore": 85, "disputeCount": 10, "protocolName": "Protocol1"}, {"averageScore": 95, "disputeCount": 5, "protocolName": "Protocol2"}]
Received: ""

[Killed] ArrowFunction
controllers/protocolController.ts:32:30
     }
 
     private formatProtocolData(data : any){
-        let value = data.map((result : any) => ({
-            protocolName: result["protocolName"],
-            disputeCount: result["disputeCount"],
-            averageScore: result["averageScore"]
-        }))
+        let value = data.map(() => undefined)
         return value
     }
killedBy: addRating tests should output with correct data
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  2

  Array [
-   Object {
-     "averageScore": 85,

[Killed] ObjectLiteral
controllers/protocolController.ts:32:49
     }
 
     private formatProtocolData(data : any){
-        let value = data.map((result : any) => ({
-            protocolName: result["protocolName"],
-            disputeCount: result["disputeCount"],
-            averageScore: result["averageScore"]
-        }))
+        let value = data.map((result : any) => ({}))
         return value
     }
killedBy: Single MongoMemoryServer Should give json data in ascending
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a"
Received: undefined

[Killed] StringLiteral
controllers/protocolController.ts:34:34
     private formatProtocolData(data : any){
         let value = data.map((result : any) => ({
             protocolName: result["protocolName"],
-            disputeCount: result["disputeCount"],
+            disputeCount: result[""],
             averageScore: result["averageScore"]
         }))
killedBy: addRating tests should output with correct data
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 0

  Array [
    Object {
      "averageScore": 85,

[Killed] StringLiteral
controllers/protocolController.ts:35:34
         let value = data.map((result : any) => ({
             protocolName: result["protocolName"],
             disputeCount: result["disputeCount"],
-            averageScore: result["averageScore"]
+            averageScore: result[""]
         }))
         return value
killedBy: addRating tests should output with correct data
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 0

  Array [
    Object {
-     "averageScore": 85,

[Killed] BlockStatement
controllers/protocolController.ts:40:34
         return value
     }
 
-    private getOrder(query : any){
-        let order = Order.Descending
-        if (query && query.order == 'ascending'){
-            order = Order.Ascending
-        }
-        return order
-    }
+    private getOrder(query : any){}
 
     async addProtocolJson(protocol : object){
killedBy: Single MongoMemoryServer Should give json data in descending
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "c"
Received: "a"

[Killed] ConditionalExpression
controllers/protocolController.ts:42:13
 
     private getOrder(query : any){
         let order = Order.Descending
-        if (query && query.order == 'ascending'){
+        if (true){
             order = Order.Ascending
         }
killedBy: Single MongoMemoryServer Should give json data in descending
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "c"
Received: "a"

[Killed] ConditionalExpression
controllers/protocolController.ts:42:13
 
     private getOrder(query : any){
         let order = Order.Descending
-        if (query && query.order == 'ascending'){
+        if (false){
             order = Order.Ascending
         }
killedBy: Single MongoMemoryServer Should give json data in ascending
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a"
Received: "c"

[Killed] BlockStatement
controllers/protocolController.ts:48:45
         return order
     }
 
-    async addProtocolJson(protocol : object){
-
-        let doc = await ProtocolModel.findOne(
-            {protocolName: protocol["protocolName"]},
-        )
-
-        if (doc == null){
-            const newProtocol = new ProtocolModel(protocol);
-            await newProtocol.save();
-            return {message : "Success in adding new protocol"}
-        }
-        doc = this.updateDoc(doc, protocol)
-        //@ts-ignore
-        doc.save()
-        return {message : "Success in updating protocol"}
-    }
+    async addProtocolJson(protocol : object){}
 
     // making public for testing
killedBy: Single MongoMemoryServer Should successfully update db
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"message": "Success in adding new protocol"}
Received: undefined

[Killed] ConditionalExpression
controllers/protocolController.ts:54:13
             {protocolName: protocol["protocolName"]},
         )
 
-        if (doc == null){
+        if (false){
             const newProtocol = new ProtocolModel(protocol);
             await newProtocol.save();
killedBy: Single MongoMemoryServer Should successfully update db
statusReason: TypeError: Cannot read properties of null (reading 'protocolName')

[Killed] BlockStatement
controllers/protocolController.ts:54:25
             {protocolName: protocol["protocolName"]},
         )
 
-        if (doc == null){
-            const newProtocol = new ProtocolModel(protocol);
-            await newProtocol.save();
-            return {message : "Success in adding new protocol"}
-        }
+        if (doc == null){}
         doc = this.updateDoc(doc, protocol)
         //@ts-ignore
killedBy: Single MongoMemoryServer Should successfully update db
statusReason: TypeError: Cannot read properties of null (reading 'protocolName')

[Killed] StringLiteral
controllers/protocolController.ts:57:31
         if (doc == null){
             const newProtocol = new ProtocolModel(protocol);
             await newProtocol.save();
-            return {message : "Success in adding new protocol"}
+            return {message : ""}
         }
         doc = this.updateDoc(doc, protocol)
killedBy: Single MongoMemoryServer Should successfully update db
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "message": "Success in adding new protocol",
+   "message": "",

[Killed] ObjectLiteral
controllers/protocolController.ts:62:16
         doc = this.updateDoc(doc, protocol)
         //@ts-ignore
         doc.save()
-        return {message : "Success in updating protocol"}
+        return {}
     }
 
killedBy: addRating tests should successfully update an existing protocol and not create a new one
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Success in updating protocol"
Received: undefined

[Killed] BlockStatement
controllers/protocolController.ts:67:52
 
     // making public for testing
     public updateAvg (docScores : number[], protocolScores : number[], 
-        numDisputes : number) : [number[], number] {
-        var newQScores = [0, 0, 0, 0, 0]
-        // element-wise sum on old q scores and incoming scores
-        newQScores =  protocolScores.map(function (num : number, idx : number) {
-            return num + docScores[idx];
-        })
-        // use updated q scores to recompute average
-        let newAvg = (newQScores.reduce(
-            (partialSum : number, a: number) => 
-            partialSum + a, 0))/((numDisputes+1)*5)
-        return [newQScores, newAvg]
-    }
+        numDisputes : number) : [number[], number] {}
 
     // making public for testing
killedBy: Single MongoMemoryServer Should correctly calculate average in newQscores
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BlockStatement
controllers/protocolController.ts:70:80
         numDisputes : number) : [number[], number] {
         var newQScores = [0, 0, 0, 0, 0]
         // element-wise sum on old q scores and incoming scores
-        newQScores =  protocolScores.map(function (num : number, idx : number) {
-            return num + docScores[idx];
-        })
+        newQScores =  protocolScores.map(function (num : number, idx : number) {})
         // use updated q scores to recompute average
         let newAvg = (newQScores.reduce(
killedBy: Single MongoMemoryServer Should correctly calculate average in newQscores
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
-   8,
-   8,

[Killed] ArithmeticOperator
controllers/protocolController.ts:71:20
         var newQScores = [0, 0, 0, 0, 0]
         // element-wise sum on old q scores and incoming scores
         newQScores =  protocolScores.map(function (num : number, idx : number) {
-            return num + docScores[idx];
+            return num - docScores[idx];
         })
         // use updated q scores to recompute average
killedBy: Single MongoMemoryServer Should correctly calculate average in newQscores
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
-   8,
-   8,

[Killed] ArithmeticOperator
controllers/protocolController.ts:74:22
             return num + docScores[idx];
         })
         // use updated q scores to recompute average
-        let newAvg = (newQScores.reduce(
-            (partialSum : number, a: number) => 
-            partialSum + a, 0))/((numDisputes+1)*5)
+        let newAvg = newQScores.reduce((partialSum: number, a: number) => partialSum + a, 0) * ((numDisputes + 1) * 5)
         return [newQScores, newAvg]
     }
killedBy: Single MongoMemoryServer Should correctly calculate final average
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 4
Received: 400

Expected precision:    2
Expected difference: < 0.005
Received difference:   396

[Killed] ArrowFunction
controllers/protocolController.ts:75:13
         })
         // use updated q scores to recompute average
         let newAvg = (newQScores.reduce(
-            (partialSum : number, a: number) => 
-            partialSum + a, 0))/((numDisputes+1)*5)
+            () => undefined, 0))/((numDisputes+1)*5)
         return [newQScores, newAvg]
     }
killedBy: addRating tests should successfully update an existing protocol
statusReason: ValidationError: protocols validation failed: averageScore: Cast to Number failed for value "NaN" (type number) at path "averageScore"

[Killed] ArithmeticOperator
controllers/protocolController.ts:76:13
         // use updated q scores to recompute average
         let newAvg = (newQScores.reduce(
             (partialSum : number, a: number) => 
-            partialSum + a, 0))/((numDisputes+1)*5)
+            partialSum - a, 0))/((numDisputes+1)*5)
         return [newQScores, newAvg]
     }
killedBy: Single MongoMemoryServer Should correctly calculate final average
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 4
Received: -4

Expected precision:    2
Expected difference: < 0.005
Received difference:   8

[Killed] ArithmeticOperator
controllers/protocolController.ts:76:35
         // use updated q scores to recompute average
         let newAvg = (newQScores.reduce(
             (partialSum : number, a: number) => 
-            partialSum + a, 0))/((numDisputes+1)*5)
+            partialSum + a, 0))/((numDisputes - 1)*5)
         return [newQScores, newAvg]
     }
killedBy: Single MongoMemoryServer Should correctly calculate final average
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 4
Received: Infinity

Expected precision:    2
Expected difference: < 0.005
Received difference:   Infinity

[Killed] ArrayDeclaration
controllers/protocolController.ts:77:16
         let newAvg = (newQScores.reduce(
             (partialSum : number, a: number) => 
             partialSum + a, 0))/((numDisputes+1)*5)
-        return [newQScores, newAvg]
+        return []
     }
 
killedBy: Single MongoMemoryServer Should correctly calculate average in newQscores
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [8, 8, 8, 8, 8]
Received: undefined

[Killed] BlockStatement
controllers/protocolController.ts:81:53
     }
 
     // making public for testing
-    public updateDoc (doc : any, protocol : object) {
-        
-        if (doc["protocolName"] !== protocol["protocolName"]) {
-            throw new Error("Protocol names don't match");
-        }
-
-        let [newQScores, newAvg] = this.updateAvg(
-            doc["qScores"], protocol["qScores"], doc["disputeCount"]
-        )
-    
-        doc["disputeCount"] += 1
-        doc["protocolName"] = protocol["protocolName"]
-        doc["averageScore"] = newAvg
-        doc["qScores"] = newQScores
-        return doc
-    }
+    public updateDoc (doc : any, protocol : object) {}
 }
killedBy: Single MongoMemoryServer should increment disputeCount by 1
statusReason: TypeError: Cannot read properties of undefined (reading 'disputeCount')

[Killed] ConditionalExpression
controllers/protocolController.ts:83:13
     // making public for testing
     public updateDoc (doc : any, protocol : object) {
         
-        if (doc["protocolName"] !== protocol["protocolName"]) {
+        if (false) {
             throw new Error("Protocol names don't match");
         }
killedBy: Single MongoMemoryServer should throw error if protocol names don't match
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "Protocol names don't match"

Received function did not throw

[Killed] BlockStatement
controllers/protocolController.ts:83:63
     // making public for testing
     public updateDoc (doc : any, protocol : object) {
         
-        if (doc["protocolName"] !== protocol["protocolName"]) {
-            throw new Error("Protocol names don't match");
-        }
+        if (doc["protocolName"] !== protocol["protocolName"]) {}
 
         let [newQScores, newAvg] = this.updateAvg(
killedBy: Single MongoMemoryServer should throw error if protocol names don't match
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "Protocol names don't match"

Received function did not throw

[Killed] StringLiteral
controllers/protocolController.ts:88:17
         }
 
         let [newQScores, newAvg] = this.updateAvg(
-            doc["qScores"], protocol["qScores"], doc["disputeCount"]
+            doc[""], protocol["qScores"], doc["disputeCount"]
         )
     
killedBy: Single MongoMemoryServer should increment disputeCount by 1
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] StringLiteral
controllers/protocolController.ts:88:38
         }
 
         let [newQScores, newAvg] = this.updateAvg(
-            doc["qScores"], protocol["qScores"], doc["disputeCount"]
+            doc["qScores"], protocol[""], doc["disputeCount"]
         )
     
killedBy: Single MongoMemoryServer should increment disputeCount by 1
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] AssignmentOperator
controllers/protocolController.ts:91:9
             doc["qScores"], protocol["qScores"], doc["disputeCount"]
         )
     
-        doc["disputeCount"] += 1
+        doc["disputeCount"] -= 1
         doc["protocolName"] = protocol["protocolName"]
         doc["averageScore"] = newAvg
killedBy: Single MongoMemoryServer should increment disputeCount by 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 11
Received: 9

[Killed] StringLiteral
controllers/protocolController.ts:91:13
             doc["qScores"], protocol["qScores"], doc["disputeCount"]
         )
     
-        doc["disputeCount"] += 1
+        doc[""] += 1
         doc["protocolName"] = protocol["protocolName"]
         doc["averageScore"] = newAvg
killedBy: Single MongoMemoryServer should increment disputeCount by 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 11
Received: 10

[Killed] StringLiteral
controllers/protocolController.ts:93:13
     
         doc["disputeCount"] += 1
         doc["protocolName"] = protocol["protocolName"]
-        doc["averageScore"] = newAvg
+        doc[""] = newAvg
         doc["qScores"] = newQScores
         return doc
killedBy: Single MongoMemoryServer should assign correct averageScore
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: undefined
