[Timeout] BlockStatement
controllers/ratingController.ts:14:82
      * @param userIdentity 
      * @param rating 
      */
-    async upsertRating(userIdentity : object, rating : Rating, protocol : string){
-        const user = await UserModel.findOne({ 
-            cookieId: userIdentity["cookieId"], 
-            walletId: userIdentity["walletId"] 
-        });
-        if (!user) 
-            return 'user not found'
-        
-        const newRating = new RatingModel(
-            {scores : rating.scores, code: rating.code})
-
-        let ratingExists = Boolean(user.protocolRatings.get(protocol))
-        if (ratingExists){
-            return "rating already submitted"
-        }
-        user.protocolRatings.set(protocol, newRating);
-        await user.save()
-        return "rating added"
-    }
+    async upsertRating(userIdentity : object, rating : Rating, protocol : string){}
 
     async handleGetRating(cookieId : string, walletId : string, protocolName : string) {

[Killed] ConditionalExpression
controllers/ratingController.ts:19:13
             cookieId: userIdentity["cookieId"], 
             walletId: userIdentity["walletId"] 
         });
-        if (!user) 
+        if (true) 
             return 'user not found'
         
killedBy: Add rating tests Should say protocol added successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rating added"
Received: "user not found"

[Timeout] BooleanLiteral
controllers/ratingController.ts:19:13
             cookieId: userIdentity["cookieId"], 
             walletId: userIdentity["walletId"] 
         });
-        if (!user) 
+        if (user) 
             return 'user not found'
         

[Killed] BlockStatement
controllers/ratingController.ts:26:26
             {scores : rating.scores, code: rating.code})
 
         let ratingExists = Boolean(user.protocolRatings.get(protocol))
-        if (ratingExists){
-            return "rating already submitted"
-        }
+        if (ratingExists){}
         user.protocolRatings.set(protocol, newRating);
         await user.save()
killedBy: Test upsert rating should return rating already submitted if user exists and       new protocol is updated
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rating already submitted"
Received: "rating added"

[Killed] ConditionalExpression
controllers/ratingController.ts:26:13
             {scores : rating.scores, code: rating.code})
 
         let ratingExists = Boolean(user.protocolRatings.get(protocol))
-        if (ratingExists){
+        if (true){
             return "rating already submitted"
         }
killedBy: Test upsert rating should return rating added if user exists and new protocol is added
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rating added"
Received: "rating already submitted"

[Killed] StringLiteral
controllers/ratingController.ts:27:20
 
         let ratingExists = Boolean(user.protocolRatings.get(protocol))
         if (ratingExists){
-            return "rating already submitted"
+            return ""
         }
         user.protocolRatings.set(protocol, newRating);
killedBy: Test upsert rating should return rating already submitted if user exists and       new protocol is updated
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rating already submitted"
Received: ""

[Killed] StringLiteral
controllers/ratingController.ts:31:16
         }
         user.protocolRatings.set(protocol, newRating);
         await user.save()
-        return "rating added"
+        return ""
     }
 
killedBy: Add rating tests Should say protocol added successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rating added"
Received: ""

[Timeout] BlockStatement
controllers/ratingController.ts:34:88
         return "rating added"
     }
 
-    async handleGetRating(cookieId : string, walletId : string, protocolName : string) {
-        let rating = await this.getUserRating(cookieId, walletId, protocolName)
-        if (rating.isNull()) return { status: 404, 
-                                message: {message : rating.getErrorMessage()}}
-
-        return {status : 200, message: rating}
-   }
+    async handleGetRating(cookieId : string, walletId : string, protocolName : string) {}
 
    /**

[Killed] ConditionalExpression
controllers/ratingController.ts:36:13
 
     async handleGetRating(cookieId : string, walletId : string, protocolName : string) {
         let rating = await this.getUserRating(cookieId, walletId, protocolName)
-        if (rating.isNull()) return { status: 404, 
+        if (false) return { status: 404, 
                                 message: {message : rating.getErrorMessage()}}
 
killedBy: Test get rating Should return User not found if user cannot be found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User not found"
Received: undefined

[Killed] ConditionalExpression
controllers/ratingController.ts:36:13
 
     async handleGetRating(cookieId : string, walletId : string, protocolName : string) {
         let rating = await this.getUserRating(cookieId, walletId, protocolName)
-        if (rating.isNull()) return { status: 404, 
+        if (true) return { status: 404, 
                                 message: {message : rating.getErrorMessage()}}
 
killedBy: Test get rating Should return rating if it exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "World"
Received: undefined

[Killed] ObjectLiteral
controllers/ratingController.ts:39:16
         if (rating.isNull()) return { status: 404, 
                                 message: {message : rating.getErrorMessage()}}
 
-        return {status : 200, message: rating}
+        return {}
    }
 
killedBy: Test get rating Should return rating if it exists
statusReason: RangeError: Invalid status code: undefined

[Timeout] BlockStatement
controllers/ratingController.ts:47:64
      * nullRating user or rating isn't found
      */
    async getUserRating(cookieId : string, 
-    walletId : string, protocolName : string) : Promise<Rating>{
-        const user = await UserModel.findOne(
-            { cookieId: cookieId, walletId: walletId });
-        if (!user){
-            return new NullRating("User not found")
-        }
-        const rating = user.protocolRatings.get(protocolName);
-        if (rating == null) return  new NullRating("Rating not found")
-
-        return Rating.fromIRating(rating)
-    }
+    walletId : string, protocolName : string) : Promise<Rating>{}
 
     async handleGetAllRatings(cookieId : string, walletId : string){

[Killed] ObjectLiteral
controllers/ratingController.ts:49:13
    async getUserRating(cookieId : string, 
     walletId : string, protocolName : string) : Promise<Rating>{
         const user = await UserModel.findOne(
-            { cookieId: cookieId, walletId: walletId });
+            {});
         if (!user){
             return new NullRating("User not found")
killedBy: Test getUserRating Should return a rating
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bar"
Received: ""

[Killed] ConditionalExpression
controllers/ratingController.ts:50:13
     walletId : string, protocolName : string) : Promise<Rating>{
         const user = await UserModel.findOne(
             { cookieId: cookieId, walletId: walletId });
-        if (!user){
+        if (true){
             return new NullRating("User not found")
         }
killedBy: Test get rating Should return rating not found if rating cannot be found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Rating not found"
Received: "User not found"

[Timeout] BlockStatement
controllers/ratingController.ts:50:19
     walletId : string, protocolName : string) : Promise<Rating>{
         const user = await UserModel.findOne(
             { cookieId: cookieId, walletId: walletId });
-        if (!user){
-            return new NullRating("User not found")
-        }
+        if (!user){}
         const rating = user.protocolRatings.get(protocolName);
         if (rating == null) return  new NullRating("Rating not found")

[Killed] ConditionalExpression
controllers/ratingController.ts:54:13
             return new NullRating("User not found")
         }
         const rating = user.protocolRatings.get(protocolName);
-        if (rating == null) return  new NullRating("Rating not found")
+        if (false) return  new NullRating("Rating not found")
 
         return Rating.fromIRating(rating)
killedBy: Test get rating Should return rating not found if rating cannot be found
statusReason: TypeError: Cannot read properties of undefined (reading 'scores')

[Killed] ConditionalExpression
controllers/ratingController.ts:54:13
             return new NullRating("User not found")
         }
         const rating = user.protocolRatings.get(protocolName);
-        if (rating == null) return  new NullRating("Rating not found")
+        if (true) return  new NullRating("Rating not found")
 
         return Rating.fromIRating(rating)
killedBy: Test get rating Should return rating if it exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "World"
Received: undefined

[Timeout] BlockStatement
controllers/ratingController.ts:59:68
         return Rating.fromIRating(rating)
     }
 
-    async handleGetAllRatings(cookieId : string, walletId : string){
-       let user = await UserModel.findOne(
-        { cookieId: cookieId, walletId: walletId });
-        if (!user ) return {status: 404, message: 
-                        {message : 'User not found'}}
-        return {status : 200, message : user.protocolRatings}
-    }
+    async handleGetAllRatings(cookieId : string, walletId : string){}
 
 

[Killed] ConditionalExpression
controllers/ratingController.ts:62:13
     async handleGetAllRatings(cookieId : string, walletId : string){
        let user = await UserModel.findOne(
         { cookieId: cookieId, walletId: walletId });
-        if (!user ) return {status: 404, message: 
+        if (false ) return {status: 404, message: 
                         {message : 'User not found'}}
         return {status : 200, message : user.protocolRatings}
killedBy: Test getting all ratings Should get all ratings
statusReason: TypeError: Cannot read properties of null (reading 'protocolRatings')

[Killed] BooleanLiteral
controllers/ratingController.ts:62:13
     async handleGetAllRatings(cookieId : string, walletId : string){
        let user = await UserModel.findOne(
         { cookieId: cookieId, walletId: walletId });
-        if (!user ) return {status: 404, message: 
+        if (user ) return {status: 404, message: 
                         {message : 'User not found'}}
         return {status : 200, message : user.protocolRatings}
killedBy: Test getting all ratings Should get all ratings
statusReason: TypeError: Cannot read properties of null (reading 'protocolRatings')
