[Killed] BlockStatement
controllers/userController.ts:9:60
 
 
     // need to make new function to take in a req and parse the req
-    async handlePostRequest(user : User) : Promise<string> {
-        const userCookie = await UserModel.findOne({ cookieId: user["cookieId"] });
-        const userWallet = await UserModel.findOne({ walletId: user["walletId"] });
-
-        let userCookieExists = Boolean(userCookie)
-        let userWalletExists = Boolean(userWallet)
-        switch (true){
-            case (!userCookieExists && userWalletExists):
-                await this.updateUserCookies(user, userWallet)
-                return "reassigned user"
-            case (userCookieExists && !userWalletExists):
-                return "non existent wallet"
-            case (userCookieExists && userWalletExists):
-                //@ts-ignore
-                return this.handleKnownUser(userCookie.id, userWallet.id)
-            default:
-                return await this.addUserToDatabase(user)
-        }
-    }
+    async handlePostRequest(user : User) : Promise<string> {}
 
     /** Assumes that user does not exist in the database */
killedBy: Test handlePostRequest Should test Existent cookie, non identifiable wallet 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "non existent wallet"
Received: undefined

[Killed] StringLiteral
controllers/userController.ts:10:69
 
     // need to make new function to take in a req and parse the req
     async handlePostRequest(user : User) : Promise<string> {
-        const userCookie = await UserModel.findOne({ cookieId: user["cookieId"] });
+        const userCookie = await UserModel.findOne({ cookieId: user[""] });
         const userWallet = await UserModel.findOne({ walletId: user["walletId"] });
 
killedBy: Test handlePostRequest Should test Existent cookie, non identifiable wallet 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "non existent wallet"
Received: "added user to database"

[Killed] ObjectLiteral
controllers/userController.ts:11:52
     // need to make new function to take in a req and parse the req
     async handlePostRequest(user : User) : Promise<string> {
         const userCookie = await UserModel.findOne({ cookieId: user["cookieId"] });
-        const userWallet = await UserModel.findOne({ walletId: user["walletId"] });
+        const userWallet = await UserModel.findOne({});
 
         let userCookieExists = Boolean(userCookie)
killedBy: Test handlePostRequest Should test Existent cookie, non identifiable wallet 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "non existent wallet"
Received: "wrong user-wallet pair"

[Killed] StringLiteral
controllers/userController.ts:11:69
     // need to make new function to take in a req and parse the req
     async handlePostRequest(user : User) : Promise<string> {
         const userCookie = await UserModel.findOne({ cookieId: user["cookieId"] });
-        const userWallet = await UserModel.findOne({ walletId: user["walletId"] });
+        const userWallet = await UserModel.findOne({ walletId: user[""] });
 
         let userCookieExists = Boolean(userCookie)
killedBy: Test handlePostRequest Should handle Wrong cookie wallet pair
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "wrong user-wallet pair"
Received: "non existent wallet"

[Timeout] BooleanLiteral
controllers/userController.ts:15:17
 
         let userCookieExists = Boolean(userCookie)
         let userWalletExists = Boolean(userWallet)
-        switch (true){
+        switch (false){
             case (!userCookieExists && userWalletExists):
                 await this.updateUserCookies(user, userWallet)

[Killed] ConditionalExpression
controllers/userController.ts:16:19
         let userCookieExists = Boolean(userCookie)
         let userWalletExists = Boolean(userWallet)
         switch (true){
-            case (!userCookieExists && userWalletExists):
+            case (false):
                 await this.updateUserCookies(user, userWallet)
                 return "reassigned user"
killedBy: Test handlePostRequest Should handle Re-assign user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "reassigned user"
Received: "added user to database"

[Killed] ConditionalExpression
controllers/userController.ts:16:19
         let userCookieExists = Boolean(userCookie)
         let userWalletExists = Boolean(userWallet)
         switch (true){
-            case (!userCookieExists && userWalletExists):
+            case (true):
                 await this.updateUserCookies(user, userWallet)
                 return "reassigned user"
killedBy: Test handlePostRequest Should test Existent cookie, non identifiable wallet 
statusReason: TypeError: Cannot set properties of null (setting 'cookieId')

[Killed] StringLiteral
controllers/userController.ts:18:24
         switch (true){
             case (!userCookieExists && userWalletExists):
                 await this.updateUserCookies(user, userWallet)
-                return "reassigned user"
+                return ""
             case (userCookieExists && !userWalletExists):
                 return "non existent wallet"
killedBy: Test handlePostRequest Should handle Re-assign user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "reassigned user"
Received: ""

[Killed] ConditionalExpression
controllers/userController.ts:19:19
             case (!userCookieExists && userWalletExists):
                 await this.updateUserCookies(user, userWallet)
                 return "reassigned user"
-            case (userCookieExists && !userWalletExists):
+            case (false):
                 return "non existent wallet"
             case (userCookieExists && userWalletExists):
killedBy: Test handlePostRequest Should test Existent cookie, non identifiable wallet 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "non existent wallet"
Received: "added user to database"

[Killed] BooleanLiteral
controllers/userController.ts:19:39
             case (!userCookieExists && userWalletExists):
                 await this.updateUserCookies(user, userWallet)
                 return "reassigned user"
-            case (userCookieExists && !userWalletExists):
+            case (userCookieExists && userWalletExists):
                 return "non existent wallet"
             case (userCookieExists && userWalletExists):
killedBy: Test handlePostRequest Should test Existent cookie, non identifiable wallet 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "non existent wallet"
Received: "added user to database"

[Killed] ConditionalExpression
controllers/userController.ts:21:19
                 return "reassigned user"
             case (userCookieExists && !userWalletExists):
                 return "non existent wallet"
-            case (userCookieExists && userWalletExists):
+            case (false):
                 //@ts-ignore
                 return this.handleKnownUser(userCookie.id, userWallet.id)
killedBy: Test handlePostRequest Should handle Wrong cookie wallet pair
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "wrong user-wallet pair"
Received: "added user to database"

[Killed] ConditionalExpression
controllers/userController.ts:21:13
                 return "reassigned user"
             case (userCookieExists && !userWalletExists):
                 return "non existent wallet"
-            case (userCookieExists && userWalletExists):
-                //@ts-ignore
-                return this.handleKnownUser(userCookie.id, userWallet.id)
+            case userCookieExists && userWalletExists:
             default:
                 return await this.addUserToDatabase(user)
killedBy: Test handlePostRequest Should handle Wrong cookie wallet pair
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "wrong user-wallet pair"
Received: "added user to database"

[Killed] ConditionalExpression
controllers/userController.ts:24:13
             case (userCookieExists && userWalletExists):
                 //@ts-ignore
                 return this.handleKnownUser(userCookie.id, userWallet.id)
-            default:
-                return await this.addUserToDatabase(user)
+            default:
         }
     }
killedBy: Test handlePostRequest Should add user to database
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "added user to database"
Received: undefined

[Killed] BlockStatement
controllers/userController.ts:30:49
     }
 
     /** Assumes that user does not exist in the database */
-    private async addUserToDatabase(user : User){
-        let userModel;
-        user["referredUsers"] = user["numReferredUsers"]
-        userModel = await new UserModel(user)
-        await userModel.save()
-        return "added user to database"
-    }
+    private async addUserToDatabase(user : User){}
     
 
killedBy: Test handlePostRequest Should add user to database
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "added user to database"
Received: undefined

[Killed] BlockStatement
controllers/userController.ts:39:67
     }
     
 
-    private async updateUserCookies(user : User, userWallet : any){
-        userWallet.cookieId = user.cookieId;
-        await UserModel.findOneAndUpdate({_id : userWallet.id}, 
-            userWallet, {upsert : true})
-
-    }
+    private async updateUserCookies(user : User, userWallet : any){}
 
     private handleKnownUser(userCookie : string, userWallet : string){
killedBy: Test handlePostRequest Should successfully reassign user cookie
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Your mom"
Received: "Sky"

[Survived] BooleanLiteral
controllers/userController.ts:42:35
     private async updateUserCookies(user : User, userWallet : any){
         userWallet.cookieId = user.cookieId;
         await UserModel.findOneAndUpdate({_id : userWallet.id}, 
-            userWallet, {upsert : true})
+            userWallet, {upsert : false})
 
     }

[Killed] BlockStatement
controllers/userController.ts:46:70
 
     }
 
-    private handleKnownUser(userCookie : string, userWallet : string){
-        if (userCookie != userWallet){
-            return "wrong user-wallet pair"
-        }
-        return "correct user-wallet pair"
-    }
+    private handleKnownUser(userCookie : string, userWallet : string){}
 
     async handleGetUserInfo(cookieId : string) {
killedBy: Test handlePostRequest Should handle Wrong cookie wallet pair
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "wrong user-wallet pair"
Received: undefined

[Killed] BlockStatement
controllers/userController.ts:47:38
     }
 
     private handleKnownUser(userCookie : string, userWallet : string){
-        if (userCookie != userWallet){
-            return "wrong user-wallet pair"
-        }
+        if (userCookie != userWallet){}
         return "correct user-wallet pair"
     }
killedBy: Test handlePostRequest Should handle Wrong cookie wallet pair
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "wrong user-wallet pair"
Received: "correct user-wallet pair"

[Killed] EqualityOperator
controllers/userController.ts:47:13
     }
 
     private handleKnownUser(userCookie : string, userWallet : string){
-        if (userCookie != userWallet){
+        if (userCookie == userWallet){
             return "wrong user-wallet pair"
         }
killedBy: Test handlePostRequest Should handle Wrong cookie wallet pair
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "wrong user-wallet pair"
Received: "correct user-wallet pair"

[Killed] StringLiteral
controllers/userController.ts:50:16
         if (userCookie != userWallet){
             return "wrong user-wallet pair"
         }
-        return "correct user-wallet pair"
+        return ""
     }
 
killedBy: Test handlePostRequest Should handle Correct cookie wallet pair
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "correct user-wallet pair"
Received: ""

[Timeout] BlockStatement
controllers/userController.ts:53:48
         return "correct user-wallet pair"
     }
 
-    async handleGetUserInfo(cookieId : string) {
-        let user = await this.getUserInfo(cookieId)
-        if (user.isNull()) return {status: 404, 
-                                message: { message: user.getErrorMessage() }}
-        return {status: 200, message: user.getUserObject()}
-    }
+    async handleGetUserInfo(cookieId : string) {}
 
     /**

[Killed] ConditionalExpression
controllers/userController.ts:55:13
 
     async handleGetUserInfo(cookieId : string) {
         let user = await this.getUserInfo(cookieId)
-        if (user.isNull()) return {status: 404, 
+        if (false) return {status: 404, 
                                 message: { message: user.getErrorMessage() }}
         return {status: 200, message: user.getUserObject()}
killedBy: Test get user info Should return null user if user does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User not found"
Received: undefined

[Killed] ConditionalExpression
controllers/userController.ts:55:13
 
     async handleGetUserInfo(cookieId : string) {
         let user = await this.getUserInfo(cookieId)
-        if (user.isNull()) return {status: 404, 
+        if (true) return {status: 404, 
                                 message: { message: user.getErrorMessage() }}
         return {status: 200, message: user.getUserObject()}
killedBy: Test get user info Should return an existing user if the user exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "owo"
Received: undefined

[Timeout] BlockStatement
controllers/userController.ts:65:58
      * if found and returns only message otherwise
      * @param cookieId 
      */
-    async getUserInfo(cookieId : string) : Promise<User> {
-        let user = await UserModel.findOne({ cookieId: cookieId})
-        if (!user){
-            return new NullUser("User not found")
-        }
-        let ret = User.createUserFromDocument(user)
-        return ret
-    }
+    async getUserInfo(cookieId : string) : Promise<User> {}
 
 

[Killed] BooleanLiteral
controllers/userController.ts:67:13
      */
     async getUserInfo(cookieId : string) : Promise<User> {
         let user = await UserModel.findOne({ cookieId: cookieId})
-        if (!user){
+        if (user){
             return new NullUser("User not found")
         }
killedBy: Test get user info Should return null user if user does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User not found"
Received: ""

[Killed] ConditionalExpression
controllers/userController.ts:67:13
      */
     async getUserInfo(cookieId : string) : Promise<User> {
         let user = await UserModel.findOne({ cookieId: cookieId})
-        if (!user){
+        if (false){
             return new NullUser("User not found")
         }
killedBy: Test get user info Should return null user if user does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User not found"
Received: ""

[Killed] BlockStatement
controllers/userController.ts:75:51
     }
 
 
-    async handleCheckUserExists(cookieId : string){
-        const user = await UserModel.findOne({ cookieId: cookieId });
-        if (!user) return false
-        return true
-    }
+    async handleCheckUserExists(cookieId : string){}
     
 }
killedBy: Check cookie id exists Should return false if user does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: ""

[Survived] ObjectLiteral
controllers/userController.ts:76:46
 
 
     async handleCheckUserExists(cookieId : string){
-        const user = await UserModel.findOne({ cookieId: cookieId });
+        const user = await UserModel.findOne({});
         if (!user) return false
         return true

[Killed] BooleanLiteral
controllers/userController.ts:77:13
 
     async handleCheckUserExists(cookieId : string){
         const user = await UserModel.findOne({ cookieId: cookieId });
-        if (!user) return false
+        if (user) return false
         return true
     }
killedBy: Check cookie id exists Should return false if user does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
controllers/userController.ts:77:27
 
     async handleCheckUserExists(cookieId : string){
         const user = await UserModel.findOne({ cookieId: cookieId });
-        if (!user) return false
+        if (!user) return true
         return true
     }
killedBy: Check cookie id exists Should return false if user does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
controllers/userController.ts:78:16
     async handleCheckUserExists(cookieId : string){
         const user = await UserModel.findOne({ cookieId: cookieId });
         if (!user) return false
-        return true
+        return false
     }
     
killedBy: Check cookie id exists Should return true if user does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
