[Timeout] BlockStatement
routes/ratings.ts:14:76
  * Client-side interface: protocolName, rating -> splice to form kv pair
  * Why do we have two post requests for doing basically the exact same thing?
  */
-router.post("/:cookieId/:walletId", async (req: Request, res: Response) => {
-    const { cookieId, walletId} = req.params;
-    const { protocolName, rating } = req.body;
-    let ratingObject = Rating.fromObject(rating)
-    let userIdentity = {"cookieId" : cookieId, "walletId" : walletId}
-    let response = await ratingController.upsertRating(userIdentity, ratingObject, protocolName)
-    res.json({message : response})
-});
+router.post("/:cookieId/:walletId", async (req: Request, res: Response) => {});
 
 

[Killed] StringLiteral
routes/ratings.ts:14:13
  * Client-side interface: protocolName, rating -> splice to form kv pair
  * Why do we have two post requests for doing basically the exact same thing?
  */
-router.post("/:cookieId/:walletId", async (req: Request, res: Response) => {
+router.post("", async (req: Request, res: Response) => {
     const { cookieId, walletId} = req.params;
     const { protocolName, rating } = req.body;
killedBy: Add rating tests Should say user not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user not found"
Received: undefined

[Killed] ObjectLiteral
routes/ratings.ts:18:24
     const { cookieId, walletId} = req.params;
     const { protocolName, rating } = req.body;
     let ratingObject = Rating.fromObject(rating)
-    let userIdentity = {"cookieId" : cookieId, "walletId" : walletId}
+    let userIdentity = {}
     let response = await ratingController.upsertRating(userIdentity, ratingObject, protocolName)
     res.json({message : response})
killedBy: Add rating tests Should say protocol added successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rating added"
Received: "user not found"

[Killed] ObjectLiteral
routes/ratings.ts:20:14
     let ratingObject = Rating.fromObject(rating)
     let userIdentity = {"cookieId" : cookieId, "walletId" : walletId}
     let response = await ratingController.upsertRating(userIdentity, ratingObject, protocolName)
-    res.json({message : response})
+    res.json({})
 });
 
killedBy: Add rating tests Should say user not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user not found"
Received: undefined

[Timeout] BlockStatement
routes/ratings.ts:24:89
 });
 
 
-router.get("/:cookieId/:walletId/:protocolName", async (req: Request, res: Response) => {
-    const { protocolName, cookieId, walletId } = req.params;
-    let response = await ratingController.handleGetRating(cookieId, walletId, protocolName)
-    res.status(response.status).json(response.message)
-});
+router.get("/:cookieId/:walletId/:protocolName", async (req: Request, res: Response) => {});
 
 /**

[Timeout] BlockStatement
routes/ratings.ts:34:56
  * GET request to fetch all the protocol ratings for a given user
  * @returns 404 if user not found
  */
-router.get('/:cookieId/:walletId', async (req, res) => {
-    const { cookieId, walletId } = req.params;
-    let response = await ratingController.handleGetAllRatings(cookieId, walletId)
-    res.status(response.status).json(response.message)
-});
+router.get('/:cookieId/:walletId', async (req, res) => {});
 
 

[Killed] StringLiteral
routes/ratings.ts:34:12
  * GET request to fetch all the protocol ratings for a given user
  * @returns 404 if user not found
  */
-router.get('/:cookieId/:walletId', async (req, res) => {
+router.get("", async (req, res) => {
     const { cookieId, walletId } = req.params;
     let response = await ratingController.handleGetAllRatings(cookieId, walletId)
killedBy: Test getting all ratings Should get all ratings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User not found"
Received: undefined
