[Timeout] BlockStatement
routes/referrals.ts:13:70
  * Returns 404 error if a referral code does not exist
  * Returns 404 error if a user uses its own referral code
  */
-router.post("/:referralCode", async (req: Request, res: Response) => {
-    const { referralCode } = req.params;
-    const { walletId } = req.body
-    let response = await referralController.handleAddReferral(referralCode, walletId)
-    res.json({message: response})
-});
+router.post("/:referralCode", async (req: Request, res: Response) => {});
 
 /**

[Timeout] BlockStatement
routes/referrals.ts:25:69
  * Returns true if there is a user with a valid code, false otherwise
  * @requires req.query to have {referralCode} in the json body
  */
-router.get("/:referralCode", async (req: Request, res: Response) => {
-    const { referralCode } = req.params;
-    let response = await referralController.checkReferralCodeExists(referralCode)
-    res.json({referralCodeExists: response})
-});
+router.get("/:referralCode", async (req: Request, res: Response) => {});
 
 export default router;
