[Survived] BooleanLiteral
models/user/UserModel.ts:21:40
 }
 
 const RatingSchema = new mongoose.Schema({
-    scores: {type: [Number], required: true},
+    scores: {type: [Number], required: false},
     code: {type: String, required: false}
 });

[Survived] ArrayDeclaration
models/user/UserModel.ts:21:20
 }
 
 const RatingSchema = new mongoose.Schema({
-    scores: {type: [Number], required: true},
+    scores: {type: [], required: true},
     code: {type: String, required: false}
 });

[Timeout] BooleanLiteral
models/user/UserModel.ts:22:36
 
 const RatingSchema = new mongoose.Schema({
     scores: {type: [Number], required: true},
-    code: {type: String, required: false}
+    code: {type: String, required: true}
 });
 

[Survived] ObjectLiteral
models/user/UserModel.ts:22:11
 
 const RatingSchema = new mongoose.Schema({
     scores: {type: [Number], required: true},
-    code: {type: String, required: false}
+    code: {}
 });
 

[Timeout] BooleanLiteral
models/user/UserModel.ts:26:41
 });
 
 const ReferralSchema = new mongoose.Schema({
-    protocol: { type: String, required: true }
+    protocol: { type: String, required: false }
 });
 

[Timeout] ObjectLiteral
models/user/UserModel.ts:26:15
 });
 
 const ReferralSchema = new mongoose.Schema({
-    protocol: { type: String, required: true }
+    protocol: {}
 });
 

[Timeout] BooleanLiteral
models/user/UserModel.ts:30:40
 });
 
 const UserSchema = new mongoose.Schema({
-    cookieId: {type: String, required: true},
+    cookieId: {type: String, required: false},
     walletId: {type: String, required: true},
     referralCode: {type: String, required: false},

[Survived] BooleanLiteral
models/user/UserModel.ts:31:40
 
 const UserSchema = new mongoose.Schema({
     cookieId: {type: String, required: true},
-    walletId: {type: String, required: true},
+    walletId: {type: String, required: false},
     referralCode: {type: String, required: false},
     referredUsers: {type: Number, required: true},

[Survived] ObjectLiteral
models/user/UserModel.ts:31:15
 
 const UserSchema = new mongoose.Schema({
     cookieId: {type: String, required: true},
-    walletId: {type: String, required: true},
+    walletId: {},
     referralCode: {type: String, required: false},
     referredUsers: {type: Number, required: true},

[Killed] BooleanLiteral
models/user/UserModel.ts:32:44
 const UserSchema = new mongoose.Schema({
     cookieId: {type: String, required: true},
     walletId: {type: String, required: true},
-    referralCode: {type: String, required: false},
+    referralCode: {type: String, required: true},
     referredUsers: {type: Number, required: true},
     protocolRatings: {type: Map, of: RatingSchema, required: false}
killedBy: Test getting all ratings Should get ratings
statusReason: ValidationError: user validation failed: referralCode: Path `referralCode` is required.

[Survived] BooleanLiteral
models/user/UserModel.ts:33:45
     cookieId: {type: String, required: true},
     walletId: {type: String, required: true},
     referralCode: {type: String, required: false},
-    referredUsers: {type: Number, required: true},
+    referredUsers: {type: Number, required: false},
     protocolRatings: {type: Map, of: RatingSchema, required: false}
 });

[Survived] BooleanLiteral
models/user/UserModel.ts:34:62
     walletId: {type: String, required: true},
     referralCode: {type: String, required: false},
     referredUsers: {type: Number, required: true},
-    protocolRatings: {type: Map, of: RatingSchema, required: false}
+    protocolRatings: {type: Map, of: RatingSchema, required: true}
 });
 

[Survived] StringLiteral
models/user/UserModel.ts:43:52
 
 const UserModel = mongoose.model<IUser>('user', UserSchema);
 const RatingModel = mongoose.model<IRating>('rating', RatingSchema);
-const ReferralModel = mongoose.model<UserReferral>('referral', ReferralSchema);
+const ReferralModel = mongoose.model<UserReferral>("", ReferralSchema);
 
 export default UserModel;
